# Cross-platform CLI tools (work on both macOS and Linux)
brew "gitui"
brew "readline"
brew "llvm"
brew "cmake"
brew "tinymist"
brew "poppler"
brew "resvg"
brew "imagemagick"
brew "yazi"
brew "p7zip"
brew "jq"
brew "ffmpeg"
brew "fzf"
brew "fd"
brew "vim"
brew "neovim"
brew "gcc"
brew "stow"
brew "neofetch"
brew "ripgrep"
brew "ruby"
brew "xclip"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "oh-my-posh"
brew "eza"
brew "zoxide"
brew "aichat"

# macOS-only GUI applications and tools
if OS.mac?
  cask "appcleaner"
  cask "font-hack-nerd-font"
  cask "font-jetbrains-mono-nerd-font"
  cask "font-symbols-only-nerd-font"
  cask "ghostty"
  cask "aerospace"
  cask "visual-studio-code"
  cask "vlc"
  cask "raycast"
  cask "onyx"
  cask "hiddenbar"
  cask "cursor"
  cask "linearmouse"
  cask "zed"
  cask "monitorcontrol"
end
